test-app/app/controllers/blogs_controller.rb

INSERT INTO "blogs" ("content", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["content", "bar"], ["created_at", Fri, 07 Oct 2016 01:04:08 UTC +00:00], ["title", "foo"], ["updated_at", Fri, 07 Oct 2016 01:04:08 UTC +00:00]]
---
  def create
    @blog = Blog.create(params.require(:blog).permit(:title, :content))

SELECT "blogs".* FROM "blogs" WHERE "blogs"."id" = 1 LIMIT 1
---
  def show
    @blog = Blog.find_by_id(params[:id])